opengl_intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3D图形和OpenGL的介绍</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="3D图形和OpenGL的介绍"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-08 五"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Git"/>
<meta name="keywords" content="Wiki"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./opengl_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">3D图形和OpenGL的介绍</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 3D 图形技术和术语</a></li>
<li><a href="#sec-2">2 3D 编程的基本原则</a>
<ul>
<li><a href="#sec-2-1">2.1 坐标系统</a></li>
<li><a href="#sec-2-2">2.2 投影：从3D到2D</a></li>
</ul>
</li>
<li><a href="#sec-3">3 OpenGL介绍</a>
<ul>
<li><a href="#sec-3-1">3.1 什么是OpenGL</a></li>
<li><a href="#sec-3-2">3.2 OpenGL支持阵容</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 3D 图形技术和术语</h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>变换（Transformation）和投影（Projection）
</li>
<li>光栅化（Rasterization）
</li>
<li>着色（Shading）
</li>
<li>纹理贴图（Texture Mapping）
</li>
<li>混合（Blending）
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 3D 编程的基本原则</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 坐标系统</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>2D笛卡儿坐标
</li>
<li>坐标裁剪
</li>
<li>视口（viewport）
</li>
<li>3D笛卡儿坐标
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 投影：从3D到2D</h3>
<div class="outline-text-3" id="text-2-2">


<ul>
<li>正投影（orthographic projection）或平行投影：建筑设计、计算机辅助设计或3D图标中。使用这种投影时，需要指定一个正方形或长方形的可视区域。可视区域外的任何物体都不会被绘制。详见 <a href="./opengl_pmatrix.html#sec-1">正投影</a> 。
</li>
<li>透视投影（pespective projection）：平截头体（frustum），近大远小。详见 <a href="./opengl_pmatrix.html#sec-2">透视投影</a> 。
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> OpenGL介绍</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 什么是OpenGL</h3>
<div class="outline-text-3" id="text-3-1">


<p>
   严格地讲，OpenGL被定义为“图形硬件的一种软件接口”。从本质上说，它是一个3D图形和模型库，具有高度的可移植性，并且具有非常快的速度。使用OpenGL，可以创建优雅而漂亮的图形，并且具有非常出色的视觉质量。
</p>
<p>
   OpenGL并不是一种像C和C++这样的编程语言，它更像是一个C运行时函数库，提供了一些预包装的功能。
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> OpenGL支持阵容</h3>
<div class="outline-text-3" id="text-3-2">


<ul>
<li>GLUT（OpenGL utility toolkit）：OpenGL实用工具包，由AUX发展而来，它可以实现跨平台的支持。一种新的GLUT实现freeglut已经崛起并取代了它的位置。
</li>
<li>GLEW：可以获得OpenGL 3.0或更高版本中的特性，已内建在GLTools中。
</li>
<li>GLTools：GLTools包含一个用于操作矩阵和向量的3D数学库，并依靠GLEW获得OpenGL3.3中用来产生和渲染一些简单3D对象的函数，以及对视觉平截头体、相机类和变换矩阵进行管理的函数的充分支持。
</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-08 五</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
